{
  "backend/main.mo": "Defines core actor with user profiles, doctors, hospitals, hire requests, notifications, and access-control‑protected CRUD operations.",
  "feature_evidence.json": "Contains feature-to-file mapping metadata for UI modules, themes, and workflows with associated components and test IDs.",
  "frontend-file-summaries.txt": "Provides short summaries of several frontend utility and UI files including analytics data, polling hook, and global CSS.",
  "frontend/index.css": "Tailwind base file defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Standard HTML entry file mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the application router, global layout, theming, and routes for doctor, hospital, and admin modules.",
  "frontend/src/components/analytics/ResponsiveCharts.tsx": "Renders responsive bar and line charts using basic SVG and Tailwind styling.",
  "frontend/src/components/doctor/AppliedJobsList.tsx": "Displays hire requests with accept/reject actions and status badges using workflow state.",
  "frontend/src/components/doctor/DoctorProfileCard.tsx": "Shows a doctor's profile with animated specialty icon, availability toggle, and edit dialog trigger.",
  "frontend/src/components/doctor/EditDoctorProfileDialog.tsx": "Dialog for editing a doctor profile, syncing form state with stored profile and submitting updates.",
  "frontend/src/components/doctor/MatchAlertPopup.tsx": "Popup dialog that shows unread match notifications and marks them read on close.",
  "frontend/src/components/doctor/NotificationsPanel.tsx": "Displays a list of notifications with unread counts and includes the match alert popup.",
  "frontend/src/components/doctor/SpecializationSelectWithHeart.tsx": "Specialization dropdown that briefly shows a heart animation when a selection changes.",
  "frontend/src/components/hospital/DoctorList.tsx": "Grid of doctor cards with details and a hire button that triggers workflow requests.",
  "frontend/src/components/hospital/DoctorSearchFilters.tsx": "Filtering UI applying search and multiple dropdown filters to a doctor list.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright info and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation links that adapt to session role plus logout handling.",
  "frontend/src/components/layout/AppLayout.tsx": "App wrapper layout containing header, routed content, and footer.",
  "frontend/src/components/payments/InvoiceDownload.ts": "Utility that generates and downloads a text invoice file for a payment record.",
  "frontend/src/components/payments/PaymentSuccessAnimation.tsx": "Full-screen success animation shown after a completed payment.",
  "frontend/src/components/shared/ImageUploadPreview.tsx": "Image upload component with previews, validation, and remove/change actions.",
  "frontend/src/hooks/useActor.ts": "Creates and returns an authenticated or anonymous backend actor using react-query and refreshes related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identity loading, and authentication state.",
  "frontend/src/hooks/useSimulatedPolling.ts": "Implements a simple interval-based polling effect placeholder.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom light/dark theme CSS variables for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin metrics and navigation actions, redirecting non-admin users away.",
  "frontend/src/pages/admin/AdminDoctorsPage.tsx": "Displays a table of doctors for admins and supports approving or rejecting registrations.",
  "frontend/src/pages/admin/AdminHospitalsPage.tsx": "Admin page listing hospitals with approval actions and role-protected access.",
  "frontend/src/pages/admin/AdminPaymentsPage.tsx": "Admin dashboard for filtering, sorting, and reviewing payment records with revenue stats.",
  "frontend/src/pages/admin/AdminSubscriptionsPage.tsx": "Admin interface to create, edit, and delete subscription plans using a modal form.",
  "frontend/src/pages/doctor/DoctorDashboardPage.tsx": "Doctor dashboard showing profile, applied jobs, and notifications with role check.",
  "frontend/src/pages/doctor/DoctorLoginPage.tsx": "Doctor login form that sets session data and redirects to the dashboard.",
  "frontend/src/pages/doctor/DoctorRegisterPage.tsx": "Doctor registration flow with multi-step details, OTP verification, and profile setup.",
  "frontend/src/pages/hospital/HospitalAnalyticsPage.tsx": "Hospital analytics dashboard showing insights and charts, gated by hospital session.",
  "frontend/src/pages/hospital/HospitalDashboardPage.tsx": "Renders the hospital dashboard with emergency mode, doctor stats, filters, and doctor list, redirecting if not authenticated.",
  "frontend/src/pages/hospital/HospitalRegisterPage.tsx": "Provides a hospital registration form that sets a session and redirects to the dashboard on success.",
  "frontend/src/pages/hospital/HospitalSubscriptionPaymentsPage.tsx": "Handles subscription plan selection, payments, auto-renew toggling, and displays payment history with success animation.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero, features, and call‑to‑action sections.",
  "frontend/src/state/adminData.ts": "Zustand store containing admin-managed doctors, hospitals, subscription plans, payments, and approval/update actions.",
  "frontend/src/state/analyticsSampleData.ts": "Zustand store providing sample analytics data for emergency trends, doctor availability, and summary insights.",
  "frontend/src/state/doctorProfile.ts": "Persistent Zustand store managing a doctor’s profile and availability toggling.",
  "frontend/src/state/emergencyMode.ts": "Zustand store controlling global emergency mode state and toggle action.",
  "frontend/src/state/notifications.ts": "Zustand store for app notifications with add, mark-as-read, and unread count tracking.",
  "frontend/src/state/seedData.ts": "Zustand store supplying static seed doctor data for search and display.",
  "frontend/src/state/session.ts": "Persistent Zustand session store managing user role, identity, and session updates.",
  "frontend/src/state/subscriptionPayments.ts": "Persistent Zustand store handling subscription selection, auto-renew, and payment history.",
  "frontend/src/state/workflows.ts": "Zustand store managing hire requests and notifications for doctor-hospital workflows.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended color system, custom animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines overall project state with schema version, summary, architecture notes, image requirements, and a list of existing implemented features."
}