{
  "backend/main.mo": "Motoko canister implementing user profiles, doctor/hospital records, hire requests, notifications, and access control with authorization and approval checks.",
  "feature_evidence.json": "Machine‑generated feature evidence report mapping UI requirements to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON list of prewritten summaries for major frontend components, pages, hooks, and state files.",
  "frontend/index.css": "Global Tailwind CSS config defining OKLCH color variables, light/dark theme tokens, and base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining routes for doctor, hospital, admin, and landing pages, wrapped in theme and toaster providers.",
  "frontend/src/components/analytics/ResponsiveCharts.tsx": "Responsive line/bar chart component rendering SVG polylines or bar elements based on input data.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Profile setup modal allowing users to enter name and select doctor or hospital type, saving the profile to the backend.",
  "frontend/src/components/doctor/AppliedJobsList.tsx": "Displays hire requests for doctors, allowing them to accept or reject each request with status badges.",
  "frontend/src/components/doctor/DoctorProfileCard.tsx": "Shows the doctor's profile with availability toggle and an option to open an edit dialog.",
  "frontend/src/components/doctor/EditDoctorProfileDialog.tsx": "Dialog form that lets doctors edit and save profile fields such as name, specialization, and experience.",
  "frontend/src/components/doctor/MatchAlertPopup.tsx": "Popup dialog that appears for unread match-type notifications and marks them as read on close.",
  "frontend/src/components/doctor/NotificationsPanel.tsx": "Lists notifications with unread counts and includes the match alert popup component.",
  "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx": "Renders a polished premium doctor profile page using static data, including contact info, ratings, and skills.",
  "frontend/src/components/doctor/SpecializationSelectWithHeart.tsx": "Dropdown to select specialization that briefly shows a heart animation when changed.",
  "frontend/src/components/hospital/DoctorList.tsx": "Displays a grid of doctor cards for hospitals with hire request actions and emergency mode styling.",
  "frontend/src/components/hospital/DoctorSearchFilters.tsx": "Filter component that allows searching and narrowing doctor lists by name, specialization, experience, location, and availability.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying copyright info and a Caffeine.ai link with tracking parameters.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation links, user session handling, and responsive mobile menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with a header, footer, and routed main content area.",
  "frontend/src/components/payments/InvoiceDownload.ts": "Generates and downloads a plain text invoice file for a payment.",
  "frontend/src/components/payments/PaymentSuccessAnimation.tsx": "Displays a modal animation confirming successful payment.",
  "frontend/src/components/shared/ImageUploadPreview.tsx": "Uploads and previews profile images with validation and removal options.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the authenticated user's profile using actor-based queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity management, and AuthClient setup.",
  "frontend/src/hooks/useSimulatedPolling.ts": "Simple hook that triggers a placeholder interval for simulated polling.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark medical-themed UI.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing counts of doctors, hospitals, revenue, subscriptions, and quick navigation actions.",
  "frontend/src/pages/admin/AdminDoctorsPage.tsx": "Admin interface listing all doctors with approval status and actions to approve or reject.",
  "frontend/src/pages/admin/AdminHospitalsPage.tsx": "Admin interface listing hospitals, subscription status, and approval workflow controls.",
  "frontend/src/pages/admin/AdminPaymentsPage.tsx": "Admin payment monitor with search, filters, sorting, and revenue/transaction summaries.",
  "frontend/src/pages/admin/AdminSubscriptionsPage.tsx": "Admin page to create, edit, and delete subscription plans via a dialog form.",
  "frontend/src/pages/doctor/DoctorDashboardPage.tsx": "Handles doctor authentication, profile checks, and shows the premium dashboard with optional profile setup.",
  "frontend/src/pages/doctor/DoctorLoginPage.tsx": "Provides doctor login via Internet Identity and redirects based on profile status.",
  "frontend/src/pages/doctor/DoctorRegisterPage.tsx": "Displays doctor registration info and routes users to Internet Identity login.",
  "frontend/src/pages/hospital/HospitalAnalyticsPage.tsx": "Shows hospital analytics with charts and metrics, restricted to hospital sessions.",
  "frontend/src/pages/hospital/HospitalDashboardPage.tsx": "Main hospital dashboard showing stats, filters, doctor list, and emergency mode controls.",
  "frontend/src/pages/hospital/HospitalRegisterPage.tsx": "Form for hospital registration that saves session data and redirects to the dashboard.",
  "frontend/src/pages/hospital/HospitalSubscriptionPaymentsPage.tsx": "Manages subscription plans, payments, history, and auto-renew settings for hospitals.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, feature highlights, and CTAs for doctor and hospital registration.",
  "frontend/src/state/adminData.ts": "Provides mock admin data for doctors, hospitals, plans, and payments, plus actions for approvals and plan management using Zustand.",
  "frontend/src/state/analyticsSampleData.ts": "Stores sample analytics datasets including emergency trends, doctor availability, and basic insights.",
  "frontend/src/state/doctorProfile.ts": "Manages a persisted doctor profile with update and availability toggle actions.",
  "frontend/src/state/emergencyMode.ts": "Simple Zustand store controlling a boolean emergency mode flag.",
  "frontend/src/state/notifications.ts": "Handles notifications list, unread count, and adding/marking notifications as read.",
  "frontend/src/state/seedData.ts": "Provides a static list of sample doctors for seeding UI displays.",
  "frontend/src/state/session.ts": "Persists user session data with setters and clear functionality.",
  "frontend/src/state/subscriptionPayments.ts": "Stores subscription plan selection, auto-renew state, and payment history with update actions.",
  "frontend/src/state/workflows.ts": "Manages hire requests and triggers notifications for new requests.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Captures the project’s state, goals, requirements, and design notes for the DOC C application."
}