{
  "kind": "build_request",
  "title": "Premium glassmorphism Doctor Profile Dashboard (3-column hero layout + animations)",
  "projectName": "DOC C",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Create a premium, glassmorphism-style Doctor Profile Dashboard UI that matches a modern hospital recruitment platform aesthetic: a full-width soft-blue medical hero background with a centered, rounded, shadowed profile card laid out in three responsive columns (left/contact/actions+rating, center/core profile details, right/about+map preview).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a professional Doctor Profile Dashboard exactly like a modern hospital recruitment platform.",
          "Full width hero background with soft blue medical theme.",
          "Use modern glassmorphism style with soft shadows.",
          "Make layout responsive (mobile + desktop)."
        ]
      },
      "acceptanceCriteria": [
        "Dashboard page shows a full-width hero background in a soft blue medical theme behind the main content.",
        "A centered profile card uses glassmorphism (semi-transparent surface + backdrop blur) with rounded corners and soft shadow.",
        "On desktop, the card renders as a clear 3-column layout (left/center/right).",
        "On mobile, the layout stacks cleanly (sections readable, actions accessible, no overflow)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Implement the left column content exactly as specified: circular doctor photo; hospital name; phone number; email; location; a 5-star rating display; a primary blue \"Contact Now\" button; and a destructive red \"Hire Doctor\" button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Left side:\n   - Circular doctor profile photo\n   - Hospital name\n   - Phone number\n   - Email\n   - Location\n   - Rating (5 star system)\n   - \"Contact Now\" button (blue)\n   - \"Hire Doctor\" button (red)"
        ]
      },
      "acceptanceCriteria": [
        "Left section includes all requested fields and both CTAs with correct button color intent (primary blue, destructive red).",
        "Doctor photo is circular and maintains aspect ratio (no stretching).",
        "Rating is rendered as a 5-star system (filled vs unfilled stars)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement the center column content exactly as specified: large Doctor Name, specialization below name, years of experience, skills list, availability status as a green badge reading \"Available Now\", and working hours.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Center section:\n   - Doctor Name (Large font)\n   - Specialization below name\n   - Years of Experience\n   - Skills list\n   - Availability status (Green badge: Available Now)\n   - Working hours"
        ]
      },
      "acceptanceCriteria": [
        "Doctor name is visually dominant (large font) and specialization is immediately below it.",
        "Experience is shown as years of experience.",
        "Skills are displayed as a clear list (e.g., chips or bullet list).",
        "Availability shows a green badge with the exact text \"Available Now\".",
        "Working hours are displayed in the center section."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Implement the right column content exactly as specified: an About section (short description) and a small map preview with a location pin indicator.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Right side:\n   - About section (short description)\n   - Small map preview with location pin"
        ]
      },
      "acceptanceCriteria": [
        "Right section contains an About heading/label and a short descriptive paragraph.",
        "A compact map preview UI is displayed with a visible location pin marker."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add smooth animations matching the specification: profile card fade-in on initial load; buttons scale slightly on hover; star rating animation; and an availability badge pulse effect.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add smooth animations:\n   - Card fade-in on load\n   - Buttons hover scale effect\n   - Star rating animation\n   - Availability badge pulse effect"
        ]
      },
      "acceptanceCriteria": [
        "On first render, the main profile card visibly fades in (not instant).",
        "Both CTA buttons have a hover interaction that scales slightly and returns smoothly.",
        "The star rating has an obvious animation (e.g., staggered reveal or subtle pop) when displayed.",
        "The availability badge visibly pulses while in the \"Available Now\" state."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Populate the Doctor Profile Dashboard with the provided dummy sample data and keep all user-facing text in English: Dr. Anil Kapoor (Neurosurgeon, 12 years experience), plus reasonable dummy values for hospital name, phone, email, location, rating, skills, working hours, and about text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use dummy sample data (Dr. Anil Kapoor, Neurosurgeon, 12 years experience).",
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "The page renders the name \"Dr. Anil Kapoor\", specialization \"Neurosurgeon\", and \"12\" years experience.",
        "Other required fields (hospital name, phone, email, location, rating, skills, working hours, about) are present using dummy values.",
        "No non-English strings are introduced in the new dashboard UI."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Integrate the new premium Doctor Profile Dashboard into the existing doctor route structure without breaking current Internet Identity authentication gating and profile setup behavior (doctor users must still be required to authenticate before viewing the dashboard).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a professional Doctor Profile Dashboard..."
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users attempting to access the doctor dashboard experience are redirected to the doctor login page as before.",
        "Authenticated users with a doctor profile can access the new premium dashboard UI.",
        "The existing profile setup dialog behavior is preserved (shown when no caller profile exists)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add any required generated static images as files under frontend/public/assets/generated and reference them from the Doctor Profile Dashboard (do not serve images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Full width hero background with soft blue medical theme.",
          "Circular doctor profile photo",
          "Small map preview with location pin"
        ]
      },
      "acceptanceCriteria": [
        "Any newly generated images are stored under frontend/public/assets/generated and loaded via /assets/generated/... URLs.",
        "No backend endpoints are introduced for serving images."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this UI-only request.",
    "Do not introduce unsupported services (no Firebase/Firestore, no external map APIs)."
  ],
  "nonGoals": [
    "Implementing real contact/hire functionality (buttons may be presentational only for this request).",
    "Adding or changing backend schemas/endpoints for doctor profile data.",
    "Adding real maps, geolocation, or third-party map providers."
  ],
  "imageRequirements": {
    "required": [
      "Soft blue medical hero background with subtle gradient and abstract healthcare shapes (doctor-hero-bg.dim_1920x600.png)",
      "Professional doctor headshot portrait suitable for a profile avatar (doctor-anil-kapoor-avatar.dim_512x512.png)",
      "Minimal map preview tile with light roads/blocks styling and a prominent location pin (map-preview-tile.dim_640x360.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}