{
  "kind": "build_request",
  "title": "DOC C: Doctor, Hospital, and System Admin modules with dashboards, workflows, and subscription UI",
  "projectName": "DOC C",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create the DOC C application shell with responsive layout, global navigation, and routing for Doctor, Hospital Admin, and System Administrator modules (including registration, login, dashboards, analytics, and subscription/payment pages).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Generate complete frontend structure with routing between Doctor, Hospital, and Admin modules."
        ]
      },
      "acceptanceCriteria": [
        "App loads with a coherent responsive layout on mobile and desktop",
        "Routes exist for Doctor: Register, Login, Dashboard; Hospital: Register, Dashboard, Analytics, Subscription/Payments; Admin: Dashboard/Management pages",
        "Navigation allows moving between modules without page reloads"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a consistent medical professional UI theme (blue + white) with clean minimal styling, modern cards/dashboards, and smooth animations across key interactions (toggles, notifications, modals, success states).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Theme: Medical professional theme (Blue + White)",
          "Design: Clean, minimal, smooth animations, responsive (mobile + desktop)",
          "Use modern UI components, cards, dashboards, and charts."
        ]
      },
      "acceptanceCriteria": [
        "UI uses a consistent blue/white palette, clean typography, and spacing across all pages",
        "Animations are present but subtle (e.g., modal/popup transitions, toggle transitions, success animation after payment)",
        "All main screens are usable on mobile and desktop breakpoints"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build the Doctor Registration page UI with fields: name, email, phone number, OTP verification flow, password creation, specialization dropdown with heart icon animation, experience (years), location, and profile photo upload (client-side preview).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "DOCTOR MODULE - Registration Page: - Name - Email - Phone Number - OTP Verification system - Password creation - Specialization (Dropdown with heart icon animation) - Experience (in years) - Location - Upload profile photo"
        ]
      },
      "acceptanceCriteria": [
        "All specified fields are present with validation and clear error messages in English",
        "OTP verification is represented as a UI flow (request OTP, enter OTP, verify) using dummy logic",
        "Specialization dropdown includes an animated heart indicator when selecting/confirming specialization",
        "Profile photo upload supports selecting an image and showing a preview"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Build the Doctor Login page UI and connect it to a dummy authentication session (no external auth provider), enabling access to the Doctor Dashboard after login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. Login Page"
        ]
      },
      "acceptanceCriteria": [
        "Login form is present and validates required inputs",
        "Upon successful dummy login, user is routed to the Doctor Dashboard",
        "Logged-in state is reflected in the UI (e.g., nav shows role/session status)"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement the Doctor Dashboard UI featuring: profile card with photo, specialization displayed inside an animated heart symbol, experience, location, availability toggle (Available/Not Available), edit profile action, notification panel for job alerts, and applied jobs section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3. Doctor Dashboard: - Profile card with photo - Specialization displayed inside animated heart symbol - Experience - Location - Availability toggle (Available / Not Available) - Edit profile option - Notification panel for job alerts - Applied jobs section"
        ]
      },
      "acceptanceCriteria": [
        "Doctor dashboard displays all required elements with realistic dummy data",
        "Availability toggle updates the displayed availability state and is persisted in app state",
        "Edit profile opens an editable UI (modal or page) and updates the displayed profile state",
        "Notifications panel and applied jobs list render and update based on dummy workflow events"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement the hospital-to-doctor matching notification experience: when a hospital requirement matches a doctor’s specialization, show a notification alert and an animated popup in the Doctor UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "4. When hospital requirement matches doctor specialization: - Show notification alert - Animated popup"
        ]
      },
      "acceptanceCriteria": [
        "Triggering a matching requirement produces an in-app notification item",
        "An animated popup/modal appears showing the alert details and can be dismissed",
        "Notifications are readable and stored in UI state so they remain visible after dismissal in the panel"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Build the Hospital Registration page UI with fields: hospital name, departments, location, accreditation, and contact details; store submitted hospital profile in dummy app state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "HOSPITAL MODULE - 1. Hospital Registration: - Hospital Name - Departments - Location - Accreditation - Contact Details"
        ]
      },
      "acceptanceCriteria": [
        "All specified fields are present and validated",
        "Submitting creates/updates the hospital profile in app state and routes to Hospital Dashboard"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Build the Hospital Dashboard UI with overview cards (Total Doctors Available, Emergency Cases, Active Hires), doctor search and filters (specialization, experience, location, availability), emergency mode toggle (red highlight mode), and a doctor list with profile info and a Hire action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. Hospital Dashboard: - Overview cards (Total Doctors Available, Emergency Cases, Active Hires) - Search bar to find doctors - Filters: - Specialization - Experience - Location - Availability - Emergency Mode Toggle (Red highlight mode) - Doctor list with: - Profile - Specialization - Experience - Hire button"
        ]
      },
      "acceptanceCriteria": [
        "Overview cards display populated dummy metrics",
        "Search and filters narrow the doctor list based on dummy doctor data",
        "Emergency Mode toggle visually switches the dashboard to a red-accent highlight state",
        "Each doctor row/card shows profile, specialization, and experience, and the Hire action triggers a hire request workflow event"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Create the Hospital Analytics section UI with charts for emergency trends and doctor availability statistics, plus performance insight cards, all populated from dummy sample data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3. Analytics Section: - Graph for emergency trends - Doctor availability statistics - Performance insights cards"
        ]
      },
      "acceptanceCriteria": [
        "At least two charts are rendered (emergency trends and doctor availability) with labeled axes/legends where applicable",
        "Performance insight cards render with meaningful dummy values and short explanatory labels",
        "Charts render responsively without overflow on mobile"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Build the System Administrator module UI to view all registered doctors and hospitals, approve/reject profiles, manage subscription plans, and monitor payments (UI-driven with dummy data).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SYSTEM ADMIN MODULE - 1. View all registered doctors 2. View all registered hospitals 3. Approve / Reject profiles 4. Manage subscription plans 5. Monitor payments"
        ]
      },
      "acceptanceCriteria": [
        "Admin pages show separate views/tables for doctors and hospitals",
        "Approve/Reject actions update the displayed status for profiles in app state",
        "Subscription plan management UI supports creating/editing/removing monthly/yearly plan definitions in dummy state",
        "Payments monitoring UI shows a payment list with statuses and basic filtering/sorting"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement the Hospital Subscription & Payments UI: plan selection (monthly/yearly), UPI payment option, card payment option, auto-renew toggle, invoice download action, payment history table, and a payment success animation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PAYMENT & SUBSCRIPTION MODULE - Subscription Plans: - Monthly - Yearly - UPI Payment option - Card Payment option - Auto renewal toggle - Invoice download option - Payment history table - Success animation after payment"
        ]
      },
      "acceptanceCriteria": [
        "Hospital can select monthly or yearly plan and see price/summary details (dummy)",
        "UI offers UPI and Card payment flows (dummy form/confirmation)",
        "Auto-renew toggle persists to subscription state",
        "Invoice download triggers a client-side download (dummy PDF/text) for a selected payment",
        "Payment history table lists prior dummy payments and newly completed payments",
        "A visible success animation plays on successful payment completion"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Implement end-to-end workflow logic using dummy sample data and simulated real-time updates: doctors register and create profiles; hospitals subscribe and search; hospitals send hire requests; doctors receive notifications; doctors accept/reject; hospital and doctor dashboards update via polling/interval-based refresh in the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "WORKFLOW LOGIC - Doctors register → Create profile - Hospitals subscribe → Search doctors - Hospital sends hire request - Doctor receives notification - Doctor accepts/rejects - Dashboard updates in real time",
          "Include dummy sample data"
        ]
      },
      "acceptanceCriteria": [
        "A hire request created from the Hospital Dashboard appears in the Doctor notifications/applied section",
        "Doctor accept/reject changes the hire request status and is reflected on both Doctor and Hospital dashboards",
        "Simulated real-time updates occur without manual page refresh (e.g., via periodic polling)",
        "Dummy datasets exist for doctors, hospitals, subscriptions, payments, and analytics and are used throughout the UI"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a Motoko backend actor that exposes CRUD-style endpoints for doctors, hospitals, hire requests, notifications, subscriptions, and payments using stable storage; integrate the frontend to fetch/mutate via React Query.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a complete modern web application called \"DOC C\" (Doctor Recruitment & Emergency Connectivity Platform)."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides query/update methods to list and mutate doctors, hospitals, and hire requests, plus subscription/payment records",
        "Data persists across canister upgrades using stable structures (no external database)",
        "Frontend uses React Query to load lists and perform mutations and reflects loading/error states",
        "App remains functional with dummy seed data if backend is empty (e.g., seed on first run or via a dedicated init action)"
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add generated static brand assets and wire them into the UI (app header/login screens) as files under frontend/public/assets/generated (do not serve images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a complete modern web application called \"DOC C\""
        ]
      },
      "acceptanceCriteria": [
        "Generated images exist in frontend/public/assets/generated with the specified filenames",
        "App header and at least one auth screen visibly uses the logo/hero image from static assets",
        "No backend endpoints are used to fetch these images"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any frontend files under immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui; compose them instead.",
    "No external databases or third-party auth providers; use only supported Internet Computer patterns.",
    "No real OTP/SMS delivery; OTP verification must be simulated within the app.",
    "No real-time WebSockets; simulate real-time updates via polling/refresh mechanisms."
  ],
  "nonGoals": [
    "Implementing real UPI/card payment processing through a payment gateway (only UI and dummy records).",
    "Sending real invoices via email or integrating email/SMS services.",
    "Production-grade identity verification for doctors/hospitals beyond the requested UI and approval status.",
    "True real-time infrastructure (WebSockets/push notifications)."
  ],
  "imageRequirements": {
    "required": [
      "Medical cross + pulse line logo on blue/white background (doc-c-logo.dim_512x512.png)",
      "Clean medical abstract hero banner with blue/white palette and subtle grid pattern (doc-c-hero.dim_1600x600.png)",
      "Minimal heart-with-stethoscope icon in blue/white for specialization animation accent (doc-c-heart-icon.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}