{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Premium Glassmorphism Doctor Profile Dashboard (3-column hero + animations)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Build the premium glassmorphism Doctor Profile Dashboard layout with a full-width soft-blue hero background and a centered 3-column responsive profile card.",
      "acceptanceCriteria": [
        "Dashboard page shows a full-width hero background in a soft blue medical theme behind the main content.",
        "A centered profile card uses glassmorphism (semi-transparent surface + backdrop blur) with rounded corners and soft shadow.",
        "On desktop, the card renders as a clear 3-column layout (left/center/right).",
        "On mobile, the layout stacks cleanly (sections readable, actions accessible, no overflow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "create",
          "description": "Create the premium dashboard UI shell (hero background + centered glassmorphism card) and implement the responsive 3-column layout (left/center/right) with mobile stacking. Use composed shadcn-ui components (e.g., Card, Button, Badge-like styling) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/doctor/DoctorDashboardPage.tsx",
          "operation": "modify",
          "description": "Swap the existing dashboard body content to render the new PremiumDoctorProfileDashboard within the existing authenticated doctor dashboard route, keeping the overall page structure responsive. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Implement the left column content: avatar, hospital/contact info, 5-star rating, and the two CTAs with correct primary/destructive styling.",
      "acceptanceCriteria": [
        "Left section includes all requested fields and both CTAs with correct button color intent (primary blue, destructive red).",
        "Doctor photo is circular and maintains aspect ratio (no stretching).",
        "Rating is rendered as a 5-star system (filled vs unfilled stars)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Implement the left column exactly: circular avatar image, hospital name, phone, email, location, 5-star rating display, primary blue \"Contact Now\" button, and destructive red \"Hire Doctor\" button (presentational only). Use shadcn-ui Button for consistent primary/destructive styling without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/assets/generated/doctor-anil-kapoor-avatar.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated professional doctor avatar image as a static asset for the circular profile photo, referenced by the premium dashboard UI (no backend image serving)."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Implement the center column content: name, specialization, experience, skills, availability badge, and working hours.",
      "acceptanceCriteria": [
        "Doctor name is visually dominant (large font) and specialization is immediately below it.",
        "Experience is shown as years of experience.",
        "Skills are displayed as a clear list (e.g., chips or bullet list).",
        "Availability shows a green badge with the exact text \"Available Now\".",
        "Working hours are displayed in the center section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Implement the center column exactly: large doctor name, specialization directly beneath, years of experience, skills list (chips or bullets), a green availability badge with exact text \"Available Now\", and working hours. Use composed shadcn-ui primitives where helpful (e.g., Card typography, Button not required here) without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Implement the right column content: About section and a compact map preview with a location pin indicator (no external map APIs).",
      "acceptanceCriteria": [
        "Right section contains an About heading/label and a short descriptive paragraph.",
        "A compact map preview UI is displayed with a visible location pin marker."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Implement the right column exactly: an About heading/label with short paragraph and a small static map preview tile image with a visible location pin indicator (UI-only; no external map APIs). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/assets/generated/map-preview-tile.dim_640x360.png",
          "operation": "create",
          "description": "Add the generated minimal map preview tile image as a static asset to be displayed in the right column (no backend image serving, no external map APIs)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add smooth UI animations: card fade-in on load, CTA hover scale, star rating animation, and pulsing availability badge.",
      "acceptanceCriteria": [
        "On first render, the main profile card visibly fades in (not instant).",
        "Both CTA buttons have a hover interaction that scales slightly and returns smoothly.",
        "The star rating has an obvious animation (e.g., staggered reveal or subtle pop) when displayed.",
        "The availability badge visibly pulses while in the \"Available Now\" state."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind animations to support the required dashboard interactions (e.g., a dedicated fade-in for the profile card and a star pop/stagger animation) while keeping existing configuration intact."
        },
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Apply animation classes: profile card fade-in on initial mount, CTA buttons hover scale with smooth transitions, star rating animation (e.g., staggered pop), and availability badge pulse while \"Available Now\". Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Populate the dashboard with the specified English dummy data for Dr. Anil Kapoor and reasonable placeholder values for all other fields.",
      "acceptanceCriteria": [
        "The page renders the name \"Dr. Anil Kapoor\", specialization \"Neurosurgeon\", and \"12\" years experience.",
        "Other required fields (hospital name, phone, email, location, rating, skills, working hours, about) are present using dummy values.",
        "No non-English strings are introduced in the new dashboard UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Add an internal dummy data object (English-only) and bind it to all UI fields, including: Dr. Anil Kapoor, Neurosurgeon, 12 years experience, hospital name, phone, email, location, rating value for 5-star display, skills list, working hours, and About text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Integrate the new dashboard UI into the existing doctor route while preserving Internet Identity authentication gating and profile setup dialog behavior.",
      "acceptanceCriteria": [
        "Unauthenticated users attempting to access the doctor dashboard experience are redirected to the doctor login page as before.",
        "Authenticated users with a doctor profile can access the new premium dashboard UI.",
        "The existing profile setup dialog behavior is preserved (shown when no caller profile exists)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/doctor/DoctorDashboardPage.tsx",
          "operation": "modify",
          "description": "Preserve existing Internet Identity gating and profile setup logic (redirect unauthenticated to /doctor/login; show ProfileSetupDialog when caller profile is missing; block non-doctor profileType) while rendering the new PremiumDoctorProfileDashboard for authenticated doctor users. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add and reference required generated static images from frontend/public/assets/generated for the hero background, avatar, and map preview (no backend image serving).",
      "acceptanceCriteria": [
        "Any newly generated images are stored under frontend/public/assets/generated and loaded via /assets/generated/... URLs.",
        "No backend endpoints are introduced for serving images."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/doctor-hero-bg.dim_1920x600.png",
          "operation": "create",
          "description": "Add the generated soft blue medical hero background image as a static asset to be used by the premium dashboard hero section (no backend image serving)."
        },
        {
          "path": "frontend/public/assets/generated/doctor-anil-kapoor-avatar.dim_512x512.png",
          "operation": "modify",
          "description": "Ensure the generated avatar asset exists at this exact path and is the one referenced by the premium dashboard for the circular doctor photo (no backend image serving)."
        },
        {
          "path": "frontend/public/assets/generated/map-preview-tile.dim_640x360.png",
          "operation": "modify",
          "description": "Ensure the generated map preview tile asset exists at this exact path and is the one referenced by the premium dashboard map preview (no external map APIs; no backend image serving)."
        },
        {
          "path": "frontend/src/components/doctor/PremiumDoctorProfileDashboard.tsx",
          "operation": "modify",
          "description": "Reference the static assets via /assets/generated/... in the premium dashboard UI: frontend/public/assets/generated/doctor-hero-bg.dim_1920x600.png for the hero background, frontend/public/assets/generated/doctor-anil-kapoor-avatar.dim_512x512.png for the avatar, and frontend/public/assets/generated/map-preview-tile.dim_640x360.png for the map preview. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}